{
  "url": "https://www.gadgetreview.com/suppressed-technologies-their-inventors-that-were-too-good-to-succeed",
  "title": "16 Suppressed Technologies & Their Inventors That Were “Too Good” to Succeed - Gadget Review",
  "description": "These 16 forgotten inventions expose how revolutionary technologies disappeared before changing the world.",
  "content": "16 Suppressed Technologies & Their Inventors That Were “Too Good” to Succeed These 16 forgotten inventions expose how revolutionary technologies disappeared before changing the world. C. da Costa C. da Costa X LinkedIn Pinterest Grew up back East, got sick of the cold and headed West. Since I was small I have been pushing buttons – both electronic and human. With an insatiable need for tech I thought “why not start a website focusing on technology, and use my dislikes and likes to post on gadgets. All Articles by C. da Costa → By C. da Costa C. da Costa LinkedIn Pinterest Twitter Grew up back East, got sick of the cold and headed West. Since I was small I have been pushing buttons – both electronic and human. With an insatiable need for tech I thought “why not start a website focusing on technology, and use my dislikes and likes to post on gadgets. All Articles by C. da Costa → Apr 8, 2025 · 8 min read Why Trust Gadget Review_ down-arrow1 up-arrow1 Our editorial process is built on human expertise, ensuring that every article is reliable and trustworthy. AI helps us shape our content to be as accurate and engaging as possible. Learn more about our commitment to integrity in our Code of Ethics . Image: Gadget Review Key Takeaways Have you heard about the inventors who changed the world, then vanished? Nikola Tesla built a tower to send free electricity worldwide, but his financial backers quickly pulled the plug when they realized the implications. Then there was Rudolf Diesel, who created engines running on common vegetable oils right before his mysterious disappearance in 1913. And don’t forget Henry Ford, who actually engineered a car made from plant fibers that could take hammer blows better than steel. These brilliant minds dared to challenge powerful industries with ideas that threatened the status quo. What really happened to these game-changing technologies? Their forgotten stories reveal the hidden forces that can squash innovation when profits are at stake. 16. Radiant Energy Device Image: Gadget Review 50,000 watts of power from thin air? Dr. T. Henry Moray’s Radiant Energy Device allegedly did just that in the 1930s, harvesting energy from space when most people were still marveling at electric toasters. Communist infiltration within the Rural Electrification Agency took the blame from Moray for his funding troubles. Government pressure to share his technology with the Soviet Union supposedly derailed his work as well. While Moray’s device gained notoriety in alternative energy circles, it lacked scientific validation and never reached mass production. The Smithsonian Magazine and IEEE Spectrum have documented his work as part of the controversial history of “free energy” devices. 15. Hendershot Generator Image: Resonant Fractals If you’re fascinated by devices that break the laws of physics, Lester Hendershot’s generator promised unlimited energy without fuel or external input—a claim that attracted aviation hero Charles Lindbergh himself. No one but Hendershot himself appeared able to make it work during his 30-year quest. Increasing scrutiny eventually led to Hendershot and his invention disappearing from public view. Despite the attention it received, the Hendershot Generator lacked independent verification and scientific evidence. It remains a subject of interest in fringe science communities but has never been replicated under controlled conditions. 14. Nikola Tesla’s Wireless Energy Transmission Image: Picryl.com The towering 187-foot Wardenclyffe Tower could have delivered free electricity worldwide, eliminating the need for power lines and democratizing energy access for generations to come. Earth itself would serve as a conductor for wireless power transmission in Tesla’s ambitious plan built between 1901-1902 . Financial backers eventually pulled the plug when they realized free energy wouldn’t exactly boost their profit margins. The project collapsed and the tower was demolished in 1917 due to financial issues. Though never fully operational, Tesla’s vision inspired ongoing research in wireless power transmission, as documented by IEEE Spectrum and the Smithsonian Magazine. 13. Williams X-Jet Image: Wikimedia Commons | ZLEA | License Stuck in rush hour traffic? The Williams X-Jet of the 1980s offered a tantalizing solution—personal flight at 60 mph using a compact turbofan engine and your own body movements as controls. Pilots controlled the craft by shifting their body weight, turning flight into a workout resembling Pilates. With a 45-minute flight time, the device showed promise as personal transportation. Despite its innovative compact design and simplified control system, the U.S. Army deemed it less effective than helicopters or drones. According to the Vertical Flight Society and National Air and Space Museum, the X-Jet never reached mass production and remained primarily an experimental concept. 12. Hemp Car Image: Wikimedia Commons | License Dwindling oil supplies worried Henry Ford, so he engineered a revolutionary solution in 1941 —a car body made from plant fibers that could withstand hammer blows better than steel while running on hemp ethanol. Achieving approximately 40 mpg and costing just $600 to prototype, the Hemp Car demonstrated remarkable efficiency. Oil industry opposition quickly mounted against cars potentially running on easily grown plants. Political pressure and regulations effectively shelved the design. According to History.com and the Henry Ford Museum, the car served as a proof of concept for alternative fuel vehicles but never reached mass production, remaining an intriguing “what if” in automotive history. 11. General Motors EV1 Image: FLickr | RightBrainPhoto | License A drag coefficient of just 0.19 made GM’s EV1 more aerodynamic than most sports cars when it silently rolled onto California roads in 1996 , promising a future without gasoline or emissions. A cultlike following developed among the 800 customers who leased them in California and Arizona. Nevertheless, GM recalled and destroyed nearly all EV1s by 2003 , citing “profitability concerns.” Nothing says corporate vision quite like destroying the future to protect the past. According to IEEE Spectrum’s “Who Killed the Electric Car?” and GM’s own archives, the EV1’s termination sparked controversy and protests. The program’s demise set electric vehicle development back years—a delay we’re still reckoning with today. 10. Royal Raymond Rife’s Cancer Research Image: Bakamakyan | License Microscopes capable of seeing live viruses and a device that destroyed cancer cells without harming healthy tissue? Rife’s technology promised medical miracles that the scientific establishment ultimately rejected. Documentation and scientific validation remain absent for claims about a 1934 clinical trial at USC showing successful treatment of 14 out of 16 terminal cancer patients. Modern medical authorities have not approved Rife machines for treating cancer, and mainstream medicine rejected his methods. While supporters argue his work was suppressed by the American Medical Association, the lack of formal medical credentials and reproducible data undermined Rife’s credibility. His approaches remain classified as pseudoscience by the scientific community. 9. Harry Hoxsey’s Cancer Treatment Image: Amazon Conventional cancer treatments often came with devastating side effects, prompting Harry Hoxsey to develop herbal formulas in the 1920s that claimed to cure cancer gently—claims that eventually led to an FDA ban in 1960 . Studies finding the treatment ineffective and potentially dangerous drove the FDA’s decision. Potassium iodide, one ingredient, could actually accelerate tumor growth. Interestingly, the NIH later acknowledged some herbs in the formula had anti-cancer properties, though not as a cure. Despite warnings from the American Cancer Society, a clinic in Tijuana, Mexico still offers the treatment. The controversy highlights the complex relationship between traditional remedies and evidence-based medicine. 8. Project XA Image: Gadget Review If you’ve ever wondered why tobacco companies didn’t make safer cigarettes sooner, Dr. James D. Mold’s Project XA demonstrates how Philip Morris actually developed one in the 1960s, then buried it to avoid liability issues. Executives at the tobacco company terminated the project in 1968 . They worried that admitting cigarettes could be safer implied their current products were dangerous, raising liability concerns for past products. According to BMJ Tobacco Control and research published in The Lancet, this innovative project never reached the market or consumer testing phase, though it contributed to ongoing debates about tobacco harm reduction. 7. Perpetual Motion / Vortex Water Revitalizer Image: Vortex Water Revitalizer Drinking lifeless tap water? Austrian naturalist Viktor Schauberger believed his Vortex Water Revitalizer could restore water’s natural energy through spiral movements, mimicking the swirling patterns found in mountain streams. Obsession with water dynamics and vortex energy drove Schauberger’s work in the 1930s-40s . The naturalist studied what he called “living water,” developing theories about water’s behavior that challenged conventional science. According to the Journal of Scientific Exploration and Water Research publications, Schauberger’s ideas continue to influence niche markets and alternative health communities, though they lack scientific validation in mainstream research. 6. Cloudbuster Image: Wikimedia | Dennis Redfield | License Ending droughts with metal pipes pointed at the sky sounds absurd, yet Wilhelm Reich’s Cloudbuster claimed exactly this power by manipulating what he called “orgone energy” in the atmosphere. Equipment seizure and destruction by the FDA in 1956 ended Reich’s experiments, and he died in prison the following year. Mainstream meteorology has rejected the concept of orgone energy, and no reputable scientific evidenc",
  "concepts": [
    "IEEE",
    "FDA",
    "cold and headed",
    "pushing buttons",
    "electronic and human",
    "an insatiable need",
    "website focusing on",
    "use my dislikes",
    "post on gadgets",
    "never reached mass",
    "ZLEA",
    "USC",
    "NIH",
    "BMJ",
    "suppressed technologies"
  ],
  "obscurity_score": 0.6,
  "accessibility_score": 1.0,
  "interesting_bits": [
    "in 1913",
    "in 1917"
  ],
  "error": null
}